report/stage_6/profiling/prev_stage/wrk2_replication_put.txt
$ wrk2 -c 128 -t 8 -d 125s -R 20000 -L -s ./scripts/put.lua http://localhost:8080/ >> output/wrk2_replication_put.txt


Running 2m test @ http://localhost:8080/
  8 threads and 128 connections
  Thread calibration: mean lat.: 1.388ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.384ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.373ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.406ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.397ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.401ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.377ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.469ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.30ms  820.73us  31.41ms   79.33%
    Req/Sec     2.64k   228.91     6.33k    66.55%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.18ms
 75.000%    1.65ms
 90.000%    2.17ms
 99.000%    3.96ms
 99.900%    7.74ms
 99.990%   16.67ms
 99.999%   24.11ms
100.000%   31.42ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.036     0.000000            2         1.00
       0.484     0.100000       230540         1.11
       0.687     0.200000       460859         1.25
       0.860     0.300000       690597         1.43
       1.022     0.400000       920283         1.67
       1.181     0.500000      1149506         2.00
       1.262     0.550000      1264108         2.22
       1.346     0.600000      1379615         2.50
       1.436     0.650000      1494254         2.86
       1.535     0.700000      1609602         3.33
       1.646     0.750000      1723960         4.00
       1.708     0.775000      1781550         4.44
       1.777     0.800000      1839391         5.00
       1.853     0.825000      1896225         5.71
       1.940     0.850000      1953913         6.67
       2.043     0.875000      2011227         8.00
       2.103     0.887500      2039996         8.89
       2.171     0.900000      2068597        10.00
       2.251     0.912500      2097441        11.43
       2.345     0.925000      2126114        13.33
       2.461     0.937500      2154961        16.00
       2.529     0.943750      2169147        17.78
       2.609     0.950000      2183537        20.00
       2.703     0.956250      2197925        22.86
       2.815     0.962500      2212207        26.67
       2.955     0.968750      2226627        32.00
       3.037     0.971875      2233730        35.56
       3.135     0.975000      2240936        40.00
       3.247     0.978125      2248203        45.71
       3.377     0.981250      2255311        53.33
       3.539     0.984375      2262468        64.00
       3.635     0.985938      2266092        71.11
       3.741     0.987500      2269640        80.00
       3.871     0.989062      2273260        91.43
       4.019     0.990625      2276816       106.67
       4.215     0.992188      2280479       128.00
       4.319     0.992969      2282234       142.22
       4.447     0.993750      2284047       160.00
       4.595     0.994531      2285814       182.86
       4.787     0.995313      2287600       213.33
       5.031     0.996094      2289389       256.00
       5.183     0.996484      2290285       284.44
       5.359     0.996875      2291184       320.00
       5.563     0.997266      2292082       365.71
       5.819     0.997656      2292981       426.67
       6.155     0.998047      2293876       512.00
       6.363     0.998242      2294327       568.89
       6.611     0.998437      2294771       640.00
       6.923     0.998633      2295224       731.43
       7.319     0.998828      2295671       853.33
       7.815     0.999023      2296120      1024.00
       8.179     0.999121      2296342      1137.78
       8.511     0.999219      2296571      1280.00
       8.935     0.999316      2296792      1462.86
       9.431     0.999414      2297021      1706.67
      10.151     0.999512      2297239      2048.00
      10.647     0.999561      2297352      2275.56
      11.071     0.999609      2297464      2560.00
      11.719     0.999658      2297576      2925.71
      12.335     0.999707      2297690      3413.33
      13.111     0.999756      2297800      4096.00
      13.671     0.999780      2297856      4551.11
      14.095     0.999805      2297913      5120.00
      14.679     0.999829      2297970      5851.43
      15.303     0.999854      2298025      6826.67
      16.063     0.999878      2298083      8192.00
      16.431     0.999890      2298110      9102.22
      16.751     0.999902      2298138     10240.00
      17.183     0.999915      2298165     11702.86
      17.727     0.999927      2298194     13653.33
      18.335     0.999939      2298221     16384.00
      18.671     0.999945      2298235     18204.44
      19.071     0.999951      2298250     20480.00
      19.375     0.999957      2298263     23405.71
      19.951     0.999963      2298277     27306.67
      20.271     0.999969      2298291     32768.00
      20.591     0.999973      2298298     36408.89
      21.391     0.999976      2298306     40960.00
      21.711     0.999979      2298313     46811.43
      22.127     0.999982      2298319     54613.33
      22.591     0.999985      2298326     65536.00
      22.815     0.999986      2298330     72817.78
      22.943     0.999988      2298333     81920.00
      24.079     0.999989      2298337     93622.86
      24.175     0.999991      2298340    109226.67
      24.943     0.999992      2298344    131072.00
      25.359     0.999993      2298346    145635.56
      25.375     0.999994      2298347    163840.00
      26.095     0.999995      2298349    187245.71
      27.167     0.999995      2298351    218453.33
      27.711     0.999996      2298353    262144.00
      28.047     0.999997      2298354    291271.11
      28.047     0.999997      2298354    327680.00
      28.223     0.999997      2298355    374491.43
      28.335     0.999998      2298356    436906.67
      28.463     0.999998      2298357    524288.00
      28.799     0.999998      2298359    582542.22
      28.799     0.999998      2298359    655360.00
      28.799     0.999999      2298359    748982.86
      28.799     0.999999      2298359    873813.33
      28.799     0.999999      2298359   1048576.00
      30.527     0.999999      2298360   1165084.44
      30.527     0.999999      2298360   1310720.00
      30.527     0.999999      2298360   1497965.71
      30.527     0.999999      2298360   1747626.67
      30.527     1.000000      2298360   2097152.00
      31.423     1.000000      2298361   2330168.89
      31.423     1.000000      2298361          inf
#[Mean    =        1.301, StdDeviation   =        0.821]
#[Max     =       31.408, Total count    =      2298361]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2499230 requests in 2.08m, 163.27MB read
  Non-2xx or 3xx responses: 129360
Requests/sec:  19994.20
Transfer/sec:      1.31MB